# Глава_5_   Pandas

In [15]:
# импорт
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

# Введение в структуры данных pandas

In [ ]:
#две основные структуры данных: Series и DataFrame

# Объект Series

Series - одномерный похожий на массвив объект, содержащий массив данных  и фссоциированный с ним массив меток, который называется индексом. Простейший объект Series состоит только из массива данных.

In [2]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

в строковом представлении Series (отображаемом в интерактивном режиме) индекс находится слева, а значения - справа

Поскольку мы не задали индекс для данных, то по умолчанию создается индекс, состоящий из целых чисел: от 0 до N-1 (N - длинна массива данных).

Имея объект Series, получить представление самого массива и его индекса можно с помощью атрибутов values и index

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
#задать индекс

In [5]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [ ]:
# для выборки одного или нескольких элементов из объекта Series можно использовать значения индекса

In [7]:
obj2['a']

-5

In [8]:
obj2['d']

4

In [10]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

Операции с массивом NumPy: фильтрация с помощью булева массива, скалярное умножение, применение математических функций, сохраняют связь между индексом и значением

In [11]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [12]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [13]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [16]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

Объекты Series можно также представить себе как упорядоченный словарь фиксированной длинны, поскольку он отображает индекс на данные. Его можно передавать многим функциям, ожидающим получить словарь.

In [17]:
'b' in obj2

True

In [18]:
'e' in obj2

False

Если имеется словарь Python, содержащий данные, то из него можно создать объект Series

In [19]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000,}

In [21]:
obj3 = Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

Если передается только словарь, то в получившемся объекте Series ключи будут храниться в индексе по порядку.

In [23]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [25]:
obj4 = Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

Три значения найденные в sdata, помещены в соответствующие им позиции, а для метки 'California' никакого значения не нашлось, поэтому ей соответствует признак NaN.

Для распознания отсутствующих данных в pandas следует использовать функции isnull  и notnull

In [28]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [29]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

При выполнении арифметических операций объект Series автоматически выравнивает данные, которые прииндексированы в разном порядке

In [30]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [31]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [32]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

У объекта Series и у его индекса имеется атрибут name

In [37]:
obj4.name = 'population'

In [38]:
obj4.index.name ='state'

In [39]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

Индекс объекта Series можно изменить на месте с помощью присваивания

In [40]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

# Объект DataFrame

Объект DataFrame представляет табличную структуру данных, состоящую из упорядоченной коллекции столбцов, причем типы значений (числовой, строковый, булев и т. д.) в разных столбцах могут различаться. В объекте DataFгame хранятся два индекса: по строкам и по столбцам. Можно считать, что это словарь, объектов Series.

операции со строками и столбцами в DataFrame в первом приближении симметричны

Внутри объекта данные хранятся в виле одного или нескольких двумерных блоков, а не в виде списка, словаря или еще какой-нибудь коллекции одномерных массивов.

Есть много способов сконструировать объект DataFrame, один из самых распространенных - на основе словаря списков одинаковой длины или массивов NumPy

In [2]:
# импорт
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [9]:
data = {'state': [ 'Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002], 
        'pop': [ 1.5, 1.7, 3.6, 2.4, 2.9 ]} 
frame = DataFrame(data)

Для получившегося DataFrame автоматически будет построен индекс, как и в случае Series, и столбцы расположатся по порядку:

In [10]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

Если задать последовательность столбцов, то столбцы DataFrame расположатся строго в указанном порядке:

In [11]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

Как и в случае Series, если запросить столбец, которого нет в data, то он будет заполнен значениями NaN:

In [12]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five'])

In [13]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [14]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

Столбец DataFrame можно извлечь как объект Series, воспользовавшись нотацией словарей, или с помощью атрибута:

In [15]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [16]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

Отметим, что возвращенный объект Series имеет тот же индекс, что и DataFrame, а его атрибут name установлен соответствующим образом (имя - равно имени столбца). Строки также можно извлечь по позиции или по имени, для чего есть два метода, один из них - ix с указанием индексного поля

In [17]:
# ix берет индекс строки
frame2.ix['three']

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [24]:
frame2.ix[3, 1]

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

'Nevada'

In [29]:
frame2.loc['two', 'state']

'Ohio'

In [31]:
frame2.iloc[3, 1]

'Nevada'

Столбцы можно модифицировать путем присваивания. Например, пустому столбцу 'debt' можно было бы присвоить скалярное значение или массив значений

In [38]:
frame2['debt'] = 16.5 
frame2

       year   state  pop  debt  deЬt
one    2000    Ohio  1.5  16.5  16.5
two    2001    Ohio  1.7  16.5  16.5
three  2002    Ohio  3.6  16.5  16.5
four   2001  Nevada  2.4  16.5  16.5
five   2002  Nevada  2.9  16.5  16.5

In [36]:
frame2['debt'] = np.arange(5.)

In [37]:
frame2

       year   state  pop  debt  deЬt
one    2000    Ohio  1.5   0.0  16.5
two    2001    Ohio  1.7   1.0  16.5
three  2002    Ohio  3.6   2.0  16.5
four   2001  Nevada  2.4   3.0  16.5
five   2002  Nevada  2.9   4.0  16.5

Когда столбцу присваивается список или массив, длина значения должна совпадать с длиной DataFrame. Если же присваивается объект Series, то он будет точно согласован с индексом DataFrame, а в "дырки" будут вставлены значения NA

In [39]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [40]:
frame2['debt'] = val

In [41]:
frame2

       year   state  pop  debt  deЬt
one    2000    Ohio  1.5   NaN  16.5
two    2001    Ohio  1.7  -1.2  16.5
three  2002    Ohio  3.6   NaN  16.5
four   2001  Nevada  2.4  -1.5  16.5
five   2002  Nevada  2.9  -1.7  16.5

Присваивание несуществующему столбцу приводит к созданию нового столбца.

In [42]:
frame2['eastern'] = frame2.state == 'Ohio'

In [46]:
frame2

       year   state  pop  debt  deЬt  eastern
one    2000    Ohio  1.5   NaN  16.5     True
two    2001    Ohio  1.7  -1.2  16.5     True
three  2002    Ohio  3.6   NaN  16.5     True
four   2001  Nevada  2.4  -1.5  16.5    False
five   2002  Nevada  2.9  -1.7  16.5    False

Для удаления столбцов служит ключевое слово del

In [49]:
del frame2['eastern']

In [50]:
frame2

       year   state  pop  debt  deЬt
one    2000    Ohio  1.5   NaN  16.5
two    2001    Ohio  1.7  -1.2  16.5
three  2002    Ohio  3.6   NaN  16.5
four   2001  Nevada  2.4  -1.5  16.5
five   2002  Nevada  2.9  -1.7  16.5

In [51]:
del frame2['deЬt']

In [54]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [53]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

Столбец, возвращенный в ответ на запрос к DataFrame по индексу, является представлением, а не копией данных. Следовательно, любые модификации этого объекта Series, найдут отражение в DataFrame. Чтобы скопировать столбец, нужно вызвать метод сору объекта Series.

Еще одна распространенная форма данных -словарь словарей

In [56]:
рор = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

Если передать его конструктору DataFrarne, то ключи внешнего словаря будут интерпретированы как столбцы, а ключи внутреннего словаря - как индексы строк

In [58]:
frame3 = DataFrame(рор)

In [59]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

транспонировать

In [60]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

Ключи внутренних словарей объединяются и сортируются для образования индекса результата. Однако этого не происходит, если индекс задан явно

In [62]:
DataFrame(рор, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

Словари объектов Series интерпретируются очень похоже

In [64]:
pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevada': frame3['Nevada'][:2]}

In [65]:
DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

Если у объектов, возвращаемых при обращении к атрибутам index и columns объекта DataFraшe, установлен атрибут name, то он также выводится

In [66]:
frame3.index.name = 'year'
frame3.columns.name = 'state'

In [67]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

Как и в случае Series, атрибут values возвращает данные, хранящиеся в DataFrame, в виде двумерного массива ndaпay

In [69]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

Если у столбцов DataFrame разные типы данных, то dtype массиnа values будет выбран так, чтобы охватить все столбцы

In [70]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

 Аргументы конструктора DataFrame

Двумерный ndarray - Матрица данных, дополнительно можно передать метки строк и столбцов

Словарь массивов, списков или кортежей - Каждая последовательность становится столбцом объекта DataFrame. Все последовательности должны быть одинаковой длины

Структурный массив NumPy - Интерпретируется так же, как «словарь массивов»

Словарь объектов Series - Каждое значение становится столбцом. Если индекс явно не задан, то индексы объектов Series объединяются и образуют индекс строк результата

Словарь словарей - Каждый внутренний словарь становится столбцом. Ключи объединяются и образуют индекс строк, как в случае «словаря объектов Series»

Список словарей или объектов Series - Каждый элемент списка становится строкой объекта DataFrame. Объединение ключей словаря или индексов объектов Series становится множеством меток столбцов DataFrame

Список списков или кортежей - Интерпретируется так же, как «двумерный ndarray»

Другой объект DataFrame -Используются индексы DataFrame, если явно не заданы другие индексы

# Индексные объекты

В индексных объектах pandas хранятся метки вдоль осей и прочие метаданные (например, имена осей). Любой массив или иная последовательность меток, указанная при конструировании Series или DataFraшe, преобразуется в объект Index:

In [2]:
# импорт
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [3]:
obj = Series(range(3), index=['a', 'b', 'с'])

In [4]:
index = obj.index

In [5]:
index

Index(['a', 'b', 'с'], dtype='object')

In [6]:
index[1:]

Index(['b', 'с'], dtype='object')

Индексные объекты неизменяемы, т. е. пользователь не может их модифицировать:

In [7]:
index[1] = 'd'

TypeError: Index does not support mutable operations

Неизменяемость важна для того, чтобы несколько структур данных могли совместно использовать один и тот же индексный объект, не опасаясь его повредить:

In [8]:
index = pd.Index(np.arange(3))

In [9]:
obj2 = Series([1.5, -2.5, 0], index=index)

In [10]:
obj2.index is index

True

При некотором усилии можно даже создать подклассы класса Index, если требуется реализовать специализированную функциональность индексирования вдоль оси.

 индексные классы:

Index  - Наиболее общий индексный объект, представляющий оси в массиве NumPy, состоящем из объектов Python

Int64Index - Специализированный индекс для целых значений

Multiindex - «Иерархический» индекс, представляющий несколько уровней индексирования по одной оси. Можно считать аналогом массива кортежей

Datetimeindex - Хранит временные метки с наносекундной точностью (представлены типом данных NumPy datetime64)

Periodindex - Специализированный индекс для данных о периодах (временных промежутках)

Индексный объект не только похож на массив, но и ведет себя как множество фиксированного размера:

In [11]:
рор = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [12]:
frame3 = DataFrame(рор)

In [13]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [14]:
'Ohio' in frame3.columns

True

In [15]:
2003 in frame3.index

False

### Методы и свойства объекта Index

append - Конкатенирует с дополнительными индексными объектами, порождая новый объект lndex

diff - Вычисляет теоретико-множественную разность, представляя ее в виде индексного объекта

intersection - Вычисляет теоретико-множественное пересечение

union - Вычисляет теоретико-множественное объединение

isin  - Вычисляет булев массив, показывающий, содержится ли каждое значение индекса в переданной коллекции

delete  - Вычисляет новый индексный объект, получающийся после удаления элемента с индексом i

drop - Вычисляет новый индексный объект, получающийся после удаления переданных значений

insert - Вычисляет новый индексный объект, получающийся после вставки элемента в позицию с индексом i

is_monotonic - Возвращает True, если каждый элемент больше или равен предыдущему

is_unique - Возвращает True, если в индексе нет повторяющихся значений

unique - Вычисляет массив уникальных значений в индексе

# Базовая функциональность

фундаментальные основы взаимодействия с данными, хранящимися в объектах Series и DataFraшe

# Переиндексация

Для объектов pandas критически важен метод reindex, т. е. возможность создания нового объекта, данные в котором согласуются с новым индексом. Рассмотрим простой пример:

In [2]:
# импорт
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [3]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'с'])

In [4]:
obj

d    4.5
b    7.2
a   -5.3
с    3.6
dtype: float64

Если вызвать reindex для этого объекта Seгies, то данные будут реорганизованы в соответствии с новым индексом, а если каких-то из имеющихся в этом индексе значений раньше не было, то вместо них будут подставлены отсутствующие значения:

In [5]:
obj2 = obj.reindex(['a', 'b', 'с', 'd', 'е'])

In [6]:
obj2

a   -5.3
b    7.2
с    3.6
d    4.5
е    NaN
dtype: float64

In [7]:
obj.reindex(['a', 'b', 'с', 'd', 'е'], fill_value=0)

a   -5.3
b    7.2
с    3.6
d    4.5
е    0.0
dtype: float64

Для упорядоченных данных, например временных рядов, иногда желательно произвести интерполяцию, или восполнение отсутствующих значений в процессе переиндексации. Это позволяет сделать параметр method; так, если задать для него значение ffill, то будет произведено прямое восполнение значений:

In [8]:
obj3 = Series( [ 'blue', 'purple', 'yellow' ], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [9]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

возможные значения нараметра method:

ffill или pad  - Восполнить (или перенести) значения в прямом направлении

bfill или backfill - Восполнить (или перенести) значения в обратном направлении

In [11]:
obj3.reindex(range(6), method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

В случае объекта DataFrame функция reindex может изменять строки, столбцы или то и другое. Если ей передать просто последовательность, то в результирующем объекте переиндексируются строки:

In [25]:
frame = DataFrame(np.arange(9).reshape( (3, 3)), index=[ 'a', 'c', 'd'], columns=[ 'Ohio', 'Texas', 'California'])

In [26]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [27]:

frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [28]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

Столбцы можно переиндексировать, задав ключевое слово columns:

In [39]:
states = ['Texas', 'Utah', 'California']

In [30]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

Строки и столбцы можно переиндексировать за одну операцию, хотя интерполяция будет применена только к строкам (к оси О):

In [53]:
frame.reindex(index=['a', 'b', 'c', 'd'], columns=states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [55]:
frame.loc[['a', 'b', 'c', 'd'], states]

C:\Users\user\Anaconda3\lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

index - Последовательность, которая должна стать новым индексом. Может быть экземпляром Index или любой другой структурой данных Python, похожей на последовательность. Экземпляр Index будет использован «как есть», без копирования

method - Метод интерполяции (восполнения), возможные значения приведены в табл. 5.4

fill_value - Значение, которой должно подставляться вместо отсутствующих значений, появляющихся в результате переиндексации

limit - При прямом или обратном восполнении максимальная длина восполняемой лакуны

level - Сопоставить с простым объектом Index на указанном уровне Multiindex, иначе выбрать подмножество

сору  - Не копировать данные, если новый индекс эквивалентен старому. По умолчанию True (т. е. всегда копировать данные)

# Удаление элементов из оси

Удалить один или несколько элементов из оси просто, если имеется индексный массив или список, не содержащий этих значений. Метод drop возвращает новый объект, в котором указанные значения удалены из оси:

In [3]:
# импорт
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [6]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'е'])

In [7]:
new_obj = obj.drop('c')

In [8]:
new_obj

a    0.0
b    1.0
d    3.0
е    4.0
dtype: float64

In [9]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
е    4.0
dtype: float64

В случае DataFrame указанные в индексе значения можно удалить из любой оси:

In [13]:
data = DataFrame(np.arange(16) .reshape((4, 4)), 
                 index=['Ohio', 'Colorado', 'Utah', 'New York'], 
                 columns=['one', 'two', 'three', 'four'])

In [11]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [15]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

# Доступ по индексу, выборка и фильтрация

Доступ по индексу к объекту Series ( obj [ ... ]) работает так же, как для массивов NшnPy с тем отличием, что индексами могут быть не только целые, но любые значения из индекса объекта Series.

In [2]:
# импорт
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [3]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [4]:
obj['b']

1.0

In [5]:
obj[1]

1.0

In [6]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [7]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [8]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [9]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

Вырезание с помощью меток отличается от обычного вырезания в Python тем, что конечная точка включается:

In [13]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [14]:
obj['b':'c'] = 5

In [15]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

Как мы уже видели, доступ по индексу к DataFrame применяется для извлечения одного или нескольких столбцов путем задания единствешюrо значения или последовательности:

In [21]:
data = DataFrame(np.arange(16) .reshape((4, 4)), 
                 index=['Ohio', 'Colorado', 'Utah', 'New York'], 
                 columns= [ 'one', 'two', 'three', 'four'])

In [22]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [23]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [26]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

У доступа по индексу есть несколько частных случаев. Во-первых, выборка строк с помощью вырезания или булева массива:

In [27]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [28]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Tакой синтаксис может показаться непоследовательным, по он был выбран исключительно из практических соображений. Еще одна возможность -доступ по индексу с помощью булева DataFramc, например порожденного в результате скалярного сравнения.

In [30]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [31]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Идея в том, чтобы сделать DataFraшe синтаксически более похожим на ndarray в данном частном случае.

In [32]:
data.ix['Colorado', ['two', 'three']]

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

two      5
three    6
Name: Colorado, dtype: int32

In [33]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [37]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [40]:
data.loc[['Colorado', 'Utah'], ['two', 'three']]

          two  three
Colorado    5      6
Utah        9     10

In [39]:
data.ix[2]

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [41]:
data.ix[: 'Utah', 'two']

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [42]:
data.ix[data.three > 5, : 3 ]

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

существует много способов выборки и реорганизации данных, содержащихся в объекте pandas.

obj [val] - Выбрать один столбец или последовательность столбцов из DataFrame. Частные случаи: булев массив (фильтрация строк), срез (вырезание строк) или булев DataFrame (установка значений в позициях, удовлетворяющих некоторому критерию)

obj.ix[val]     - Выбрать одну строку или подмножество строк из DataFrame

obj.ix[:, val]  - Выбрать один столбец или подмножество столбцов

obj.ix[vall, val2] - Выбрать строки и столбцы

метод reindex -  
Привести одну или несколько осей в соответствие с новыми индексами

методы icol, irow - Выбрать одну строку или столбец соответственно по целочисленному номеру и вернуть объект Series

методы get_value, set_value - Выбрать одно значение по меткам строки и столбца

# Арифметические операции и выравнивание данных

Одна из самых важных черт pandas -поведение арифметических операций для объектов с разными индексами. Если при сложении днух объектов обнаруживаются различные пары индексов, то результирующий индекс будет объединением индексов.

In [1]:
# импорт
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [4]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [6]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [7]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

Вследствие внутреннего выравнивания данных образуются отсутствующие значения в позициях, для которых не нашлось соответственной пары. Отсутствующие значения распространяются на последующие операции.

В случае DataFrame выравнивание производится как для строк, так и для столбцов:

In [8]:
df1 = DataFrame(np.arange(9.0).reshape((3,3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.0).reshape((4,3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [9]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [10]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

При сложении этих объектов получается DataFrame, индекс и столбцы которого являются объединениями индексов и столбцов слагаемых:

In [11]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

# Восполнение значений в арифметических методах

При выполнении арифметических операций с объектами, проиндексированными по-разному, иногда желательно поместить специальное значение, например 0, в позиции операнда, которым в другом операнде соответствует отсутствующая позиция:

In [12]:
df1=DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))

In [13]:
df2=DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))

In [14]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [15]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [16]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [17]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [18]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

Гибкие арифметические методы, где можно применить fill_value

add сложение +

sub вычитание -

div деление /

mul умножение *

# Операции между DataFrame и Series

Как и в случае массивов NumPy, арифметические операции между DataFrame и Series корректно определены. В качестве пояснительного примера рассмотрим вычисление разности между двумерным массивом и одной из его строк:

In [1]:
# импорт
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [3]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [4]:
arr[0]

array([0., 1., 2., 3.])

In [5]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

Это называется укладыванием

In [7]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [8]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [10]:
series = frame.ix[0]
series

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

По умолчанию при выполнении арифметических операций между DataFrarne и Series индекс Series сопоставляется со столбцами DataFrarne, а укладываются строки:

In [11]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

Если какой-нибудь индекс не найден либо в столбцах DataFraшe, либо в индексе Series, то объекты переиндексируются для образования объединения.

In [12]:
series2 = Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [13]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

Если вы хотите вместо этого сопоставлять строки, а укладывать столбцы, то должны будете воспользоваться каким-нибудь арифметическим методом.

In [15]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [16]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [17]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

Передаваемый номер оси -это ось, вдоль которой производится сопоставление. В данном случае мы хотим сопоставлять с индексом строк DataFrame и укладывать поперек.

In [18]:
frame.sub(series3, axis=1)

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

# Применение функций и отображение

Универсальные функции NumPy (поэлементные методы массивов) отлично работают и с объектами pandas:

In [1]:
# импорт
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'), index= [ 'Utah' , 'Ohio' , 'Texas' , 'Oregon' ] )

In [3]:
frame

               b         d         e
Utah    1.635282 -1.052647  0.944892
Ohio    0.691455 -0.036078  1.130857
Texas   0.686820 -0.384106  1.165280
Oregon -0.287682 -0.689433  1.301467

In [4]:
np.abs(frame)

               b         d         e
Utah    1.635282  1.052647  0.944892
Ohio    0.691455  0.036078  1.130857
Texas   0.686820  0.384106  1.165280
Oregon  0.287682  0.689433  1.301467

Еще одна часто встречающаяся операция - применение функции, определенной для одномерных массивов, к каждому столбцу или строке. Именно это и делает метод apply объекта DataFrame:

In [8]:
f = lambda x: x.max() - x.min()

In [9]:
frame.apply(f)

b    1.922964
d    1.016569
e    0.356576
dtype: float64

In [10]:
frame.apply(f, axis=1)

Utah      2.687929
Ohio      1.166935
Texas     1.549387
Oregon    1.990900
dtype: float64

Многие из наиболее распространенных статистик массивов (например, surn и mean) - методы DataFrame, поэтому применять apply в этом случае необязательно. Функция, передаваемая методу apply, не обязана возвращать скалярное значение, она может вернуть и объект Series, содержащий несколько значений:

In [17]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [18]:
frame.apply(f)

            b         d         e
min -0.287682 -1.052647  0.944892
max  1.635282 -0.036078  1.301467

Можно использовать и поэлементные функции Python. Допустим, требуется вычислить форматированную строку для каждого элемента frame с плавающей точкой. Это позволяет сделать метод applymap:

In [20]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d     e
Utah     1.64  -1.05  0.94
Ohio     0.69  -0.04  1.13
Texas    0.69  -0.38  1.17
Oregon  -0.29  -0.69  1.30

Этот метод называется applymap, потому что в классе Series есть метод map для применения функции к каждому элементу:

In [21]:
frame['e'].map(format)

Utah      0.94
Ohio      1.13
Texas     1.17
Oregon    1.30
Name: e, dtype: object

# Сортировка и ранжирование

Сортировка набора данных по некоторому критерию - еще одна важная встроенная операция. Для лексикографической сортировки по индексу служит метод sort_index, который возвращает новый отсортированный объект

In [1]:
# импорт
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])

In [3]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

В случае Dataf raшe можно сортировать по индексу, ассоциированному с любой осью:

In [4]:
frame = DataFrame(np.arange(8).reshape((2,4)), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])

In [5]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [6]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [7]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

По умолчанию данные сортируются в порядке возрастания, но можно отсортировать их и в порядке убывания:

In [8]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [10]:
obj = Series([4, 7, -3, 2])

In [12]:
#сортировка по значениям
obj.sort_values(ascending=True)

2   -3
3    2
0    4
1    7
dtype: int64

In [15]:
obj = Series([4, 7, -3, 2, np.nan, 9, -5])
obj.sort_values(ascending=True)

6   -5.0
2   -3.0
3    2.0
0    4.0
1    7.0
5    9.0
4    NaN
dtype: float64

Объект Dataframe можно сортировать по значениям в одном или нескольких столбцах. Для этого имена столбцов следует передать в качестве значения параметра bу:

In [17]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [18]:
#сортируем только одну колонку от меньшего к большему
frame.sort_index(by='b')

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [19]:
#сортировка по нескольким столбцам
frame.sort_index(by=['a', 'b'])

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

Раижироваиие тесно связано с сортировкой, заключается оно в присваивании рангов - от единицы до числа присутствующих в массиве элементов. Это аналогично косвенным индексам, порождаемым методом numpy.argsort, с тем отличием, что существует правило обработки связанных рангов. Для ранжирования применяется метод rank объектов Series и DataFrame; по умолчанию rank обрабатывает связанные ранги, присваивая каждой группе средний ранг:

In [21]:
obj =Series([7, -5, 7, 4, 2, 0, 4])

In [22]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

Ранги можно также присваивать в соответствии с порядком появления в данных:

In [23]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [24]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

 DataFrame умеет вычислять ранги как по строкам, так и по столбцам:

In [25]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0,1], 'c':[-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [26]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

 Способы обработки связанных рангов 
    
'average' По умолчанию: одинаковым значениям присвоить средний ранг 
    
 'min'     Всем элементам группы присвоить минимальный ранг 

'max'   Всем элементам группы присвоить максимальный ранг 

'first'  Присваивать ранги в порядке появления значений в наборе данных

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rank.html

https://www.geeksforgeeks.org/python-pandas-dataframe-rank/

# Индексы по осям с повторяющимися значениями

Во всех рассмотренных до сих пор примерах метки на осях (значения индекса) были уникальны. Хотя для многих функций pandas (например, reindex) требуется уникальность меток, в общем случае это необязательно. Рассмотрим небольшой объект Series с повторяющимися значениями в индексе:

In [1]:
# импорт
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [3]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [4]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

О том, являются значения уникальными или нет, можно узнать, опросив свойство is_unique:

In [5]:
obj.index.is_unique

False

Выборка данных - одна из основных операций, поведение которых меняется в зависимости от наличия или отсутствия дубликатов. При доступе по индексу, встречающемуся несколько раз, возвращается объект Series; если же индекс одиночный, то скалярное значение:

In [7]:
obj['a']

a    0
a    1
dtype: int64

In [8]:
obj['c']

4

Такое же правило действует и для доступа к строкам в DataFrame:

In [10]:
df = DataFrame(np.random.randn(4,3), index=['a', 'a', 'b', 'b'])

In [11]:
df

          0         1         2
a -0.487669  0.095238 -0.663536
a -0.284506  0.906665  0.412899
b -0.186335 -0.287083 -0.480736
b  0.183012 -0.336458  0.015256

In [12]:
df.ix['b']

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          0         1         2
b -0.186335 -0.287083 -0.480736
b  0.183012 -0.336458  0.015256

In [13]:
df.loc['b']

          0         1         2
b -0.186335 -0.287083 -0.480736
b  0.183012 -0.336458  0.015256

# Редукция и вычисление описательных статистик

Объекты pandas оснащены набором стандартных математических и статистических методов. Большая их часть попадает в категорию редукций, или сводных статистик -методов, которые вычисляют единственное значение (например, сумму или среднее) для Series или объект Series - для строк либо столбцов DataFrame. По сравнению с эквивалентными методами массивов NшnPy, все они игнорируют отсутствующие значения. Рассмотрим небольшой объект DataFraшe:

In [2]:
# импорт
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
              index=['a', 'b', 'c', 'd'],
              columns=['one', 'two'])

In [4]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

Метод sum объекта DataFrame возвращает Series, содержащий суммы по столбцам:

In [5]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [6]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

Отсутствующие значения исключаются, если только не является отсутствующим весь срез (в данном случае строка или столбец). Это можно подавить, задав параметр skipna:

In [7]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

Перечень часто употребляемых параметров методов редукции

axis  - Ось, по которой производится редуцирование. В случае DataFrame О означает строки, 1 -столбцы.

skipna - Исключать отсутствующие значения. По умолчанию тrue

level - Редуцировать с группировкой по уровням, если индекс по оси иерархический (Multilndex)

Некоторые методы, например idxmin и idxmax, возвращают косвенные статистики, скажем, индекс, при котором достигается минимум или максимум:

In [8]:
df.idxmax()

one    b
two    d
dtype: object

In [10]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

Есть также аккумулирующие методы:

In [9]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

Наконец, существуют методы, не относящиеся ни к редуцирующим, ни к аккумулирующим. Примером может служить метод describe, который возвращает несколько сводных статистик за одно обращение:

In [11]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

В случае нечисловых данных describe возвращает другие сводные статистики:

In [12]:
obj = Series(['a', 'a', 'b', 'c'] * 4)

In [13]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [14]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

Полный список сводных статистик и родственных методов

count - Количество значений, исключая отсутствующие 

describe - Вычисляет набор сводных статистик для Series или для каждого столбца DataFrame

min, max - Вычисляет минимальное или максимальное значение 

argmin, argmax - Вычисляет позицию в индексе (целые числа), при котором достигается минимальное или максимальное значение соответственно 

idxmin, idxmax - Вычисляет значение индекса, при котором достигается минимальное или максимальное значение соответственно 

quantile - Вычисляет выборочный квантиль в диапазоне от О до 1 

(Кванти́ль в математической статистике — значение, которое заданная случайная величина не превышает с фиксированной вероятностью. )

sum - Сумма значений 

mean - Среднее значение 

median - Медиана (50%-ый квантиль) 

mad  - Среднее абсолютное отклонение от среднего 

var - Выборочная дисперсия 

std - Выборочное стандартное отклонение 

skew  - Асимметрия (третий момент) 

kurt - Куртозис (четвертый момент) 

cumsum - Нарастающая сумма 

cummin, cummax  - Нарастающий минимум или максимум соответственно 

cumprod - Нарастающее произведение 

diff - Первая арифметическая разность (полезно для временных рядов) 

pct_change - Вычисляет процентное изменение 

https://ru.wikipedia.org/wiki/%D0%9C%D0%BE%D0%BC%D0%B5%D0%BD%D1%82%D1%8B_%D1%81%D0%BB%D1%83%D1%87%D0%B0%D0%B9%D0%BD%D0%BE%D0%B9_%D0%B2%D0%B5%D0%BB%D0%B8%D1%87%D0%B8%D0%BD%D1%8B

Матожидание(первый момент) - среднее

Дисперсия M((X-MX)^2)
второй момент

Асимметрия (третий момент) 

Куртозис (четвертый момент) 

M- матожидание

X - случайная величина

# Корреляция и ковариация

Некоторые сводные статистики, например корреляция и ковариация, вычисляются по парам аргументов. Рассмотрим объекты DataFrame, содержащие цены акций и объемы биржевых сделок:

In [ ]:
import pandas.io.data as web
all_data = ()
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2000', '1/1/2010')
    
price = DataFrame({tic: data['Adj Close']
                  for tic, data in all_data.interitems()})
volume = DataFrame({tic: data['Volume']
                   for tic, data in all_data.interitems()})

returns = price.pct_change()

returns.tail()

Метод corr объекта Series вычисляет корреляцию перекрывающихся, отличных от NA, выровненных по индексу значений в двух объектах Series. Соответственно, метод cov вычисляет ковариацию:

a.corr(b)

In [ ]:
returns.MSFT.corr(returns.IBM)

In [ ]:
returns.MSFT.cov(returns.IBM)

In [5]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(1000, 3), columns=['a', 'b', 'c'])

In [7]:
df.corr()

          a         b         c
a  1.000000  0.002167  0.024065
b  0.002167  1.000000  0.011724
c  0.024065  0.011724  1.000000

In [8]:
df['a'].corr(df['b'])

0.0021672427649529276

С помощью метода corrwi th объекта DataFrame можно вычислить попарные корреляции между столбцами или строками DataFrame и другим объектом Series или DataFrame. Если передать ему объект Series, то будет возвращен Series, содержащий значения корреляции, вычисленные для каждого столбца:

In [10]:
df.corrwith(df['b'])

a    0.002167
b    1.000000
c    0.011724
dtype: float64

In [14]:
df1 = pd.DataFrame(np.random.randn(1000, 3), columns=['a', 'b', 'c'])

In [15]:
df1.corrwith(df)

a    0.028688
b    0.026099
c   -0.000121
dtype: float64

другой метод подсчета корреляции

In [11]:
df.corr(method='spearman')

          a         b         c
a  1.000000 -0.009997  0.043993
b -0.009997  1.000000  0.008368
c  0.043993  0.008368  1.000000

Если передать axis=l, то будут вычислены корреляции строк. Во всех случаях перед началом вычислений данные выравниваются по меткам.

# Уникальные значения, счетчики значений и членство

Еще один класс методов служит для извлечения информации о значениях, хранящихся в одномерном объекте Series. Для иллюстрации рассмотрим пример:

In [2]:
# импорт
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [3]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

Метод unique возвращает массив уникальных значений в Series:

In [4]:
uniques = obj.unique()

In [5]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

Уникальные значения необязательно возвращаются в отсортированном порядке, но могут быть отсортированы впоследствии, если это необходимо ( uniques. sort () ). Метод value_counts вычисляет объект Series, содержащий частоты встречаемости значений

In [7]:
uniques.sort()

In [8]:
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [6]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

Для удобства этот объект отсортирован по значениям в порядке убывания. Функция value_counts может быть также вызвана как метод pandas верхнего уровня и в таком случае применима к любому массиву или последовательности

In [9]:
pd.value_counts(obj.values, sort=False)

b    2
d    1
a    3
c    3
dtype: int64

Наконец, метод isin вычисляет булев вектор членства в множестве и может быть полезен для фильтрации набора данных относительно подмножества значений в объекте Series или столбце DataFrame:

In [11]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [10]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [13]:
list(zip(obj, mask))

[('c', True),
 ('a', False),
 ('d', False),
 ('a', False),
 ('a', False),
 ('b', True),
 ('b', True),
 ('c', True),
 ('c', True)]

isin - Вычисляет булев массив, показывающий, содержится ли каждое принадлежащее Series значение в переданной последовательности

unique - Вычисляет массив уникальных значений в Series и возвращает их в порядке появления

value_counts - Возвращает объект Series, который содержит уникальное значение в качестве индекса и его частоту в качестве соответствующего значения. Отсортирован в порядке убывания частот

Иногда требуется вычислить гистограмму нескольких взаимосвязанных столбцов в DataFrame. Приведем пример:

In [14]:
data = DataFrame({
    'Qu1': [1, 3, 4, 3, 4],
    'Qu2': [2, 3, 1, 2, 3],
    'Qu3': [1, 5, 2, 4, 4]
})

In [15]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

Передача pandas.value_counts методу apply этого объекта DataFrame дает:

In [16]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

# Обработка отсутствующих данных

Отсутствующие данные - типичное явление в большинстве аналитических приложений. При проектировании pandas в качестве одной из целей ставилась задача сделать работу с отсутствующими данными как можно менее болезненной. Например, выше мы видели, что при вычислении всех описательных статистик для объектов pandas отсутствующие данные не учитываются. В pandas для представления отсутствующих данных в любых массивах -как чисел с плавающей точкой, так и иных -используется значение с плавающей точкой NaN (не число). Это просто признак, который легко распознать:

In [17]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [18]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [19]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

Встроенное в Python значение None также рассматривается как отсутствующее в массивах объектов:

In [20]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

dropna - Фильтрует метки оси в зависимости от того, существуют ли для метки отсутствующие данные, причем есть возможность указать различные пороги, определяющие, какое количество отсутствующих данных считать допустимым

fillna - Восполняет отсутствующие данные указанным значением или использует какой-нибудь метод интерполяции, например 'ffill' или 'bfill'

isnull - Возвращает объект, содержащий булевы значения, которые показывают, какие значения отсутствуют

notnull - Логическое отрицание isnull

# Фильтрация отсутствующих данных

Существует ряд средств для фильтрации отсутствующих данных. Конечно, можно сделать это и вручную, но часто бывает полезен метод dropna. Для Series он возвращает другой объект Series, содержащий только данные и значения индекса, отличные от NA

In [10]:
from numpy import nan as NA
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [11]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

Естественно, это можно было бы вычислить и самостоятельно с помощью булевой индексации:

In [13]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

В случае объектов DataFrame все немного сложнее. Можно отбрасывать строки или столбцы, если они содержат только NА-значения или хотя бы одно NАзначение. По умолчанию метод dropna отбрасывает все строки, содержащие хотя бы одно отсутствующее значение

In [15]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [18]:
cleaned = data.dropna()

In [17]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
cleaned

     0    1    2
0  1.0  6.5  3.0

Если передать параметр how= 'all', то будут отброшены строки, которые целиком состоят из отсутствующих значений:

In [20]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

Для отбрасывания столбцов достаточно передать параметр axis=1:

In [21]:
data[4] = NA

In [22]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [23]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

Родственный способ фильтрации строк DataFrame в основном применяется к временным рядам. Допустим, требуется оставить только строки, содержащие определенное количество наблюдений. Этот порог можно задать с помощью аргумента thresh:

In [24]:
df = DataFrame(np.random.randn(7, 3))

In [25]:
df.ix[:4, 1] = NA

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [26]:
df.ix[:2, 2] = NA

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [27]:
df

          0         1         2
0 -1.424161       NaN       NaN
1 -0.343768       NaN       NaN
2 -0.915403       NaN       NaN
3 -0.628041       NaN  0.771269
4  0.946879       NaN  1.071672
5 -1.475127  0.936037  0.665873
6 -1.447329  1.464387  0.069773

In [28]:
df.dropna(thresh=3)

          0         1         2
5 -1.475127  0.936037  0.665873
6 -1.447329  1.464387  0.069773

# Восполнение отсутствующих данных

Иногда отсутствующие данные желательно не отфильтровывать (и потенциально вместе с ними отбрасывать полезные данные), а каким-то способом заполнить "дыры". В большинстве случаев для этой цели можно использовать метод fillna. Ему передается константа, подставляемая вместо отсутствующих значений:

In [1]:
from numpy import nan as NA
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
df = DataFrame(np.random.randn(7, 3))

In [3]:
df.ix[:4, 1] = NA
df.ix[:2, 2] = NA

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

In [4]:
df

          0         1         2
0  0.740479       NaN       NaN
1 -0.801871       NaN       NaN
2 -1.088347       NaN       NaN
3 -0.866281       NaN  1.285070
4 -1.511488       NaN -0.275600
5 -1.462133 -0.330953 -0.996052
6 -1.114204 -1.791063  0.827113

In [5]:
df.fillna(0)

          0         1         2
0  0.740479  0.000000  0.000000
1 -0.801871  0.000000  0.000000
2 -1.088347  0.000000  0.000000
3 -0.866281  0.000000  1.285070
4 -1.511488  0.000000 -0.275600
5 -1.462133 -0.330953 -0.996052
6 -1.114204 -1.791063  0.827113

Если передать методу fillna словарь, то можно будет подставлять вместо отсутствующих данных значение, зависящее от столбца:

In [7]:
df.fillna({1: 0.5, 2: -1})

          0         1         2
0  0.740479  0.500000 -1.000000
1 -0.801871  0.500000 -1.000000
2 -1.088347  0.500000 -1.000000
3 -0.866281  0.500000  1.285070
4 -1.511488  0.500000 -0.275600
5 -1.462133 -0.330953 -0.996052
6 -1.114204 -1.791063  0.827113

Метод fillna возвращает новый объект, но можно также модифицировать существующий объект на месте:

In [8]:
df

          0         1         2
0  0.740479       NaN       NaN
1 -0.801871       NaN       NaN
2 -1.088347       NaN       NaN
3 -0.866281       NaN  1.285070
4 -1.511488       NaN -0.275600
5 -1.462133 -0.330953 -0.996052
6 -1.114204 -1.791063  0.827113

In [10]:
# всегда возвращает ссылку на заполненный объект 
_ = df.fillna(0, inplace=True)

In [11]:
df

          0         1         2
0  0.740479  0.000000  0.000000
1 -0.801871  0.000000  0.000000
2 -1.088347  0.000000  0.000000
3 -0.866281  0.000000  1.285070
4 -1.511488  0.000000 -0.275600
5 -1.462133 -0.330953 -0.996052
6 -1.114204 -1.791063  0.827113

Те же методы интерполяции, что применяются для переиндексации, годятся и для fillna:

In [12]:
df = DataFrame(np.random.randn(6, 3))
df

          0         1         2
0  0.068334 -0.430569 -0.470638
1 -0.152587  0.987754 -2.040322
2 -1.196544  1.765736  1.134896
3 -1.114546  2.208312  0.096637
4  0.541022  0.171381  0.418952
5  0.779456  0.857725  0.468188

In [14]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] =NA

In [15]:
df

          0         1         2
0  0.068334 -0.430569 -0.470638
1 -0.152587  0.987754 -2.040322
2 -1.196544       NaN  1.134896
3 -1.114546       NaN  0.096637
4  0.541022       NaN       NaN
5  0.779456       NaN       NaN

In [16]:
df.fillna(method='ffill')

          0         1         2
0  0.068334 -0.430569 -0.470638
1 -0.152587  0.987754 -2.040322
2 -1.196544  0.987754  1.134896
3 -1.114546  0.987754  0.096637
4  0.541022  0.987754  0.096637
5  0.779456  0.987754  0.096637

In [17]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.068334 -0.430569 -0.470638
1 -0.152587  0.987754 -2.040322
2 -1.196544  0.987754  1.134896
3 -1.114546  0.987754  0.096637
4  0.541022       NaN  0.096637
5  0.779456       NaN  0.096637

При некоторой изобретательности можно использовать fillna и другими способами. Например, можно передать среднее или медиану объекта Series:

In [18]:
data = Series([1., NA, 3.5, NA, 7])

In [19]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [20]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

Справочная информация о методе fillna:

value - Скалярное значение или похожий на словарь объект для восполнения отсутствующих значений

method - Метод интерполяции. По умолчанию, если не задано других аргументов, предполагается метод "ffill"

axis - Ось, по которой производится восполнение. По умолчанию axis=O 

inplace - Модифицировать исходный объект, не создавая копию 

limit - Для прямого и обратного восполнения максимальное количество непрерывных заполняемых промежутков

# Иерархическое индексирование

Иерархическое индексирование - важная особенность pandas, позволяющая организовать несколько (два и более) уровней индексирования по одной оси. Говоря абстрактно, это способ работать с многомерными данными, представив их в форме с меньшей размерностью. Начнем с простого примера - создадим объект Series с индексом в виде списка списков или массивов:

In [11]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [12]:
data = Series(np.random.randn(10), index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'], [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    0.131277
   2    0.497100
   3   -1.640638
b  1    1.537974
   2   -0.513438
   3    0.110569
c  1    0.529472
   2   -0.689383
d  2    0.355205
   3    0.801926
dtype: float64

Здесь мы видим отформатированное представление Series с му льтииндексом (MultiIndex). «Разрывы» в представлении индекса означают «взять значение вышестоящей метки».

In [13]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

Для иерархически индексированного объекта возможен доступ по так называемому частичному индексу, что позволяет лаконично записывать выборку подмножества данных:

In [7]:
data['b']

1    0.793334
2   -1.824495
3   -2.018455
dtype: float64

In [8]:
data['b':'c']

b  1    0.793334
   2   -1.824495
   3   -2.018455
c  1    0.298925
   2    0.873487
dtype: float64

In [9]:
data.ix[['b', 'd']]

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

b  1    0.793334
   2   -1.824495
   3   -2.018455
d  2    1.722426
   3    0.222572
dtype: float64

In [10]:
data.loc[['b', 'd']]

b  1    0.793334
   2   -1.824495
   3   -2.018455
d  2    1.722426
   3    0.222572
dtype: float64

В некоторых случаях возможна даже выборка с «внутреннего» уровня:

In [11]:
data[:, 2]

a   -1.926639
b   -1.824495
c    0.873487
d    1.722426
dtype: float64

Иерархическое индексирование играет важнейшую роль в изменении формы данных и групповых операциях, в том числе построении сводных таблиц.

Эти данные можно было бы преобразовать в DataFrame с помощью метода unstack:

In [12]:
data.unstack()

          1         2         3
a -0.756388 -1.926639 -0.496088
b  0.793334 -1.824495 -2.018455
c  0.298925  0.873487       NaN
d       NaN  1.722426  0.222572

Обратной к unstack операцией является stack:

In [14]:
data.unstack().stack()

a  1   -0.756388
   2   -1.926639
   3   -0.496088
b  1    0.793334
   2   -1.824495
   3   -2.018455
c  1    0.298925
   2    0.873487
d  2    1.722426
   3    0.222572
dtype: float64

В случае DataFrame иерархический индекс можно построить по любой оси:

In [3]:
frame =DataFrame(np.arange(12).reshape((4,3)),
                index=[['a', 'a', 'b', 'b'],
                      [1, 2, 1, 2]],
                columns=[['Ohio', 'Ohio', 'Colorado'],
                        ['Green', 'Red', 'Green']])

In [3]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

Уровни иерархии могут иметь имена (как строки или любые объекты Python). В таком случае они будут показаны при выводе на консоль (не путайте имена индексов с метками на осях!)

In [4]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

Доступ по частичному индексу, как и раньше, позволяет выбирать группы столбцов:

In [5]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

Мультииндекс можно создать отдельно, а затем использовать повторно; в показанном выше объекте DataFrame столбцы с именами уровней можно было бы создать так:

In [6]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                   names=['state', 'color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           codes=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

# Уровни переупорядочения и сортировки

Иногда требуется изменить порядок уровней на оси или отсортировать данные по значениям на одной уровне. Метод swaplevel принимает номера или имена двух уровней и возвращает новый объект, в котором эти уровни переставлены (но во всех остальных отношениях данные не изменяются):

In [9]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [7]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

С другой стороны, метод sortlevel выполняет устойчивую сортировку данных, используя только значения на одном уровне. После перестановки уровней обычно вызывают также sortlevel, чтобы лексикографически отсортировать результат:

In [1]:
import numpy as np
import pandas as pd
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                index=[['b', 'a', 'a', 'b'],
                      [2, 1, 1, 2]],
                columns=[['Ohio', 'Ohio', 'Colorado'],
                        ['Green', 'Red', 'Green']])
#print('frame before', frame)
#print(frame.index.sortlevel(0, ascending=False))
#print('frame after', frame)
print('Сортировка по возрастанию ', frame.index.sortlevel(0, ascending=True))
print('Сортировка по убыванию ', frame.index.sortlevel(0, ascending=False))
print(frame)

Сортировка по возрастанию  (MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 0, 1, 1]]), array([1, 2, 0, 3], dtype=int64))
Сортировка по убыванию  (MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[1, 1, 0, 0], [1, 1, 0, 0]]), array([3, 0, 2, 1], dtype=int64))
     Ohio     Colorado
    Green Red    Green
b 2     0   1        2
a 1     3   4        5
  1     6   7        8
b 2     9  10       11

Производительность выборки данных из иерархически индексированных объектов будет гораздо выше, если индекс отсортирован лексикографически, начиная с самого внешнего уровня, т. е. в результате вызова sortleve l (О) или sort_index () .

# Сводная статистика по уровню

У многих методов объектов DataFrame и Series, вычисляющих сводные и описательные статистики, имеется параметр level для задания уровня, на котором требуется производить суммирование по конкретной оси. Рассмотрим тот же объект DataFrame, что и выше; мы можем суммировать по уровню для строк или для столбцов:

In [7]:
frame.index.names = ['keyl', 'key2']
frame.columns.names = [ 'state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
keyl key2
b    2        0   1        2
a    1        3   4        5
     1        6   7        8
b    2        9  10       11

In [8]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
2         9  11       13
1         9  11       13

In [9]:
frame.sum(level='color', axis=1)

color      Green  Red
keyl key2
b    2         2    1
a    1         8    4
     1        14    7
b    2        20   10

Реализовано это с помощью имеющегося в pandas механизма groupby.

# Работа со столбцами DataFrame

Не так уж редко возникает необходимость использовать один или несколько столбцов DataFrame в качестве индекса строк; альтернативно можно переместить индекс строк в столбцы DataFrame. Рассмотрим пример

In [5]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                  'c': ['one', 'one', 'one', 'two', 'two','two','two'],
                  'd': [0, 1, 2, 0, 1, 2, 3]})

In [6]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

Метод set_index объекта DataFrame создает новый DataFrame, используя в качестве индекса один или несколько столбцов:

In [7]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

По умолчанию столбцы удаляются из DataFrame, хотя их можно и оставить:

In [8]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

Есть также метод reset_index, который делает прямо противоположное set_ index; уровни иерархического индекса перемещаются в столбцы:

In [9]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

# Другие возможности pandas

# Доступ по целочисленному индексу

При работе с объектами pandas, проиндексированными целыми числами, начинающие часто попадают в ловушку из-за некоторых различий с семантикой доступа по индексу к встроенным в Python структурам данных, в частности, спискам и кортежам. Например, вряд ли вы ожидаете ошибки в таком коде:

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
ser = Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [3]:
ser[-1]

KeyError: -1

В данном случае pandas могла бы прибегнуть к целочисленному индексированию, но я не знаю никакого общего и безопасного способа сделать это, не внося тонких ошибок. Здесь мы имеем индекс, содержащий значения О, 1, 2, но автоматически попять, чего хочет пользователь (индекс по метке или по позиции) трудно

С другой стороны, когда индекс не является целым числом, неоднозначности не возникает

In [4]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])

In [5]:
ser2[-1]

2.0

In [6]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

Чтобы не оставлять места разноречивым интерпретациям, принято решение: если индекс по оси содержит индексаторы, то доступ к данным по целочисленному индексу всегда трактуется как доступ по метке. Это относится и к полю ix:

In [7]:
ser.ix[:1]

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

0    0.0
1    1.0
dtype: float64

In [8]:
ser.iloc[:1]

0    0.0
dtype: float64

In [9]:
ser.loc[:'b']

0    0.0
1    1.0
2    2.0
dtype: float64

In [10]:
ser2.iloc[-1]

2.0

В случае, когда требуется надежный доступ по номеру позиции вне зависимости от типа индекса, можно использовать метод iat объекта Series или методы irow и icol объекта DataFrame:

In [11]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3

-5    0
 1    1
 3    2
dtype: int64

In [15]:
# доступ по номеру позиции
ser3.iat[-1]

2

In [17]:
frame = pd.DataFrame(np.arange(6).reshape(3,2), index=[2, 0, 1])
frame

   0  1
2  0  1
0  2  3
1  4  5

In [20]:
#выводим первую строчку
frame.iloc[0]

0    0
1    1
Name: 2, dtype: int32

In [22]:
#выводим строчку с индексом 0
frame.loc[0]

0    2
1    3
Name: 0, dtype: int32

# Структура данных Раnеl

Panel -  трехмерный аналог DataFrame

При разработке pandas основное внимание уделялось манипуляциям с табличными данными, поскольку о них проще рассуждать, а наличие иерархических индексов в большинстве случаев позволяет обойтись без настоящих N-мерных массивов.

Для создания Panel используется словарь объектов DataFrame или трехмерный массив ndarray:

https://www.tutorialspoint.com/python_pandas/python_pandas_panel.htm

Имена для 3-х осей предназначены для придания некоторого семантического значения описанию операций с данными панели. Они -

items - ось 0, каждый элемент соответствует DataFrame, содержащемуся внутри.

major_axis - ось 1, это индекс (строки) каждого из фреймов данных.

minor_axis - ось 2, это столбцы каждого из DataFrames.

In [23]:
# creating an empty panel
import pandas as pd
import numpy as np

data = np.random.rand(2,4,5)
p = pd.Panel(data)
print(p)

<class 'pandas.core.panel.Panel'>
Dimensions: 2 (items) x 4 (major_axis) x 5 (minor_axis)
Items axis: 0 to 1
Major_axis axis: 0 to 3
Minor_axis axis: 0 to 4

C:\Users\user\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2961: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  exec(code_obj, self.user_global_ns, self.user_ns)

Панель может быть создана несколькими способами, такими как -

ndarrays и словарь DataFrame

In [25]:
#creating an empty panel
import pandas as pd
import numpy as np

data = {'Item1' : pd.DataFrame(np.random.randn(4, 3)), 
   'Item2' : pd.DataFrame(np.random.randn(4, 2))}
p = pd.Panel(data)
print(p)

<class 'pandas.core.panel.Panel'>
Dimensions: 2 (items) x 4 (major_axis) x 3 (minor_axis)
Items axis: Item1 to Item2
Major_axis axis: 0 to 3
Minor_axis axis: 0 to 2

C:\Users\user\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2961: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  exec(code_obj, self.user_global_ns, self.user_ns)

In [26]:
p['Item1']

          0         1         2
0 -0.396267 -0.931855 -0.030238
1 -0.276830  0.066494 -1.264644
2  0.699020  0.757026  0.082300
3  0.143126 -0.809024 -1.443386

In [28]:
p['Item1'][1][1]

0.06649370677749938

In [29]:
#major_xs - строка
p.major_xs(1)

      Item1     Item2
0 -0.276830 -1.233049
1  0.066494  0.729260
2 -1.264644       NaN

In [30]:
#minor_xs - столбец
p.minor_xs(1)

      Item1     Item2
0 -0.931855 -1.762914
1  0.066494  0.729260
2  0.757026  2.246353
3 -0.809024  2.557018